tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "vitorgalvao/tiny-scripts"
brew "bat"
brew "composer"
brew "diff-so-fancy"
brew "fzf"
brew "git"
brew "mysql"
brew "nvm"
brew "php"
brew "ripgrep"
brew "rsync"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "alfred"
cask "bartender"
cask "bitwarden"
cask "brave-browser"
cask "docker"
cask "figma"
cask "firefox"
cask "firefox-developer-edition"
cask "google-chrome"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements"
cask "lando"
cask "macdown"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "virtualbox"
