tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Manage compile and link flags for libraries
brew "pkg-config"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Move files and folders to the trash
brew "macos-trash"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Cross-shell prompt for astronauts
brew "starship"
# Code-search similar to ack
brew "the_silver_searcher"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Flexible and fast Zsh plugin manager
brew "zinit"
# General-purpose lossless data-compression library
brew "zlib"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application launcher and productivity software
cask "alfred"
# Web browser focusing on privacy
cask "brave-browser"
# Disk space visualizer
cask "daisydisk"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Launcher for *Epic Games* games
cask "epic-games"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox-developer-edition"
cask "font-fira-code-nerd-font"
# Game client
cask "gog-galaxy"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Local development environment and DevOps tool built on Docker
cask "lando"
# Software for Logitech devices
cask "logi-options-plus"
# Open-source Markdown editor
cask "macdown"
# Bridges ProtonMail to email clients supporting IMAP and SMTP protocols
cask "protonmail-bridge"
# Monitors the computer system and optimizes its performance
cask "sensei"
# Team communication and collaboration software
cask "slack"
# Application to control your PlayStation 4
cask "sony-ps4-remote-play"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Set up, configure, manage and analyze your UniFi network
cask "ubiquiti-unifi-controller"
# Desktop storage area for notes, files and pasteboard clips
cask "unclutter"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "webex"
# Install and switch between multiple versions of Xcode
cask "xcodes"
