tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "vitorgalvao/tiny-scripts"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8", link: false
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Manage multiple Node.js versions
brew "nvm"
# General-purpose scripting language
brew "php"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# General-purpose lossless data-compression library
brew "zlib"
# Next-generation plugin manager for zsh
brew "zplug"
# Quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "bartender"
cask "bitwarden"
cask "brave-browser"
cask "daisydisk"
cask "discord"
cask "docker"
cask "epic-games"
cask "figma"
cask "firefox"
cask "firefox-developer-edition"
cask "font-fira-code"
cask "gog-galaxy"
cask "google-chrome"
cask "istat-menus"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements"
cask "lando"
cask "logitech-options"
cask "macdown"
cask "microsoft-office"
cask "slack"
cask "sony-ps4-remote-play"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "ubiquiti-unifi-controller"
cask "unclutter"
cask "unity-hub"
cask "virtualbox"
mas "AdGuard for Safari", id: 1440147259
mas "Magnet", id: 441258766
mas "PiPer", id: 1421915518
mas "Silicio", id: 933627574
mas "Xcode", id: 497799835
