tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Mac App Store command-line interface
brew "mas"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# General-purpose lossless data-compression library
brew "zlib"
# Next-generation plugin manager for zsh
brew "zplug"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "bartender"
cask "bitwarden"
cask "brave-browser"
cask "daisydisk"
cask "discord"
cask "docker"
cask "epic-games"
cask "figma"
cask "firefox-developer-edition"
cask "font-fira-code"
cask "gog-galaxy"
cask "google-chrome"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "lando"
cask "logitech-options"
cask "macdown"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "slack"
cask "sony-ps4-remote-play"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "ubiquiti-unifi-controller"
mas "1Blocker", id: 1107421413
mas "Xcode", id: 497799835
