tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "khanhas/tap"
tap "vitorgalvao/tiny-scripts"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Emacs dependency management
brew "cask"
# Dependency Manager for PHP
brew "composer"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq", restart_service: true
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Manage multiple Node.js versions
brew "nvm"
# General-purpose scripting language
brew "php"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Vi 'workalike' with many additional features
brew "vim"
# Next-generation plugin manager for zsh
brew "zplug"
# Command-line tool to customize Spotify client
brew "khanhas/tap/spicetify-cli"
# Quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "alfred"
cask "bartender"
cask "bitwarden"
cask "brave-browser"
cask "docker"
cask "figma"
cask "firefox"
cask "firefox-developer-edition"
cask "font-fira-code"
cask "google-chrome"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements"
cask "lando"
cask "logitech-options"
cask "macdown"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office"
cask "microsoft-teams"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "virtualbox"
cask "visual-studio-code"
cask "webex-meetings"
cask "wrike"
cask "zoomus"
mas "AdGuard for Safari", id: 1440147259
mas "Magnet", id: 441258766
mas "PiPer", id: 1421915518
mas "Silicio", id: 933627574
mas "Xcode", id: 497799835
