tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "khanhas/tap"
tap "vitorgalvao/tiny-scripts"
# Automatic configure script builder
brew "autoconf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Dependency Manager for PHP
brew "composer"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Core application library for C
brew "glib"
# GNOME XML library
brew "libxml2"
# Move files and folders to the trash
brew "macos-trash"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# GUI for vim, made for macOS
brew "macvim"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql", restart_service: true
# Manage multiple Node.js versions
brew "nvm"
# General-purpose scripting language
brew "php", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Next-generation plugin manager for zsh
brew "zplug"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Application launcher and productivity software
cask "alfred"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# App to build and share containerized applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
cask "font-fira-code"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Local development environment and DevOps tool built on Docker
cask "lando"
# Software for Logitech devices
cask "logitech-options"
# Open-source Markdown editor
cask "macdown"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Open-source code editor
cask "visual-studio-code"
cask "webex-meetings"
# Project management app
cask "wrike"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Blocker", id: 1365531024
mas "Magnet", id: 441258766
